<?php

return [

    'codes' => [
        -1 => "خطای غیر منتظره",
        11 => "کاربر مسدود شده است.",
        12 => "API Key یافت نشد.",
        13 => "درخواست شما از طریق IP نامعتبر ارسال شده است.",
        14 => "وب سرویس شما در حال بررسی است و یا تایید نشده است.",
        15 => "سرویس مورد نظر در دسترس نمی باشد.",
        21 => "حساب بانکی متصل به وب سرویس تایید نشده است.",
        22 => "وب سریس یافت نشد.",
        23 => "اعتبار سنجی وب سرویس ناموفق بود.",
        24 => "حساب بانکی مرتبط با این وب سرویس غیر فعال شده است.",
        31 => "کد تراکنش id نباید خالی باشد.",
        32 => "شماره سفارش order_id نباید خالی باشد.",
        33 => "مبلغ amount نباید خالی باشد.",
        34 => "مبلغ amount کمتر از حد مجاز است.",
        35 => "مبلغ amount بیشتر از حد مجاز است.",
        36 => "مبلغ amount بیشتر از حد مجاز است.",
        37 => "آدرس بازگشت callback نباید خالی باشد.",
        38 => "دامنه شما در لیست دامنه های مجاز در آیدی پی ثبت نشده است.",
        39 => "آدرس بازگشت callback نامعتبر است.",
        41 => "فیلتر وضعیت تراکنش ها می بایست آرایه ای (لیستی) از وضعیت های مجاز در مستندات باشد.",
        42 => "فیلتر تاریخ پرداخت می بایست آرایه ای شامل المنت های min و max از نوع timestamp باشد.",
        43 => "فیلتر تاریخ تسویه می بایست آرایه ای شامل المنت های min و max از نوع timestamp باشد.",
        44 => "فیلتر تراکنش صحیح نمی باشد.",
        51 => "تراکنش ایجاد نشد.",
        52 => "استعلام نتیجه ای نداشت.",
        53 => "تایید پرداخت امکان پذیر نیست.",
        54 => "مدت زمان تایید پرداخت سپری شده است.",
        'unknown' => "خطای ناشناخته رخ داده است",
    ],

];
